# https://drive.google.com/file/d/1kd3poS7uN1Gj6fOqSg1W9Ncns0luZwSS/view?usp=sharing
# coding=utf8
# Написать программу, которая будет складывать, вычитать, умножать или делить два числа. Числа и знак операции вводятся пользователем. После выполнения вычисления программа не завершается, а запрашивает новые данные для вычислений. Завершение программы должно выполняться при вводе символа '0' в качестве знака операции. Если пользователь вводит неверный знак (не '0', '+', '-', '*', '/'), программа должна сообщать об ошибке и снова запрашивать знак операции. Также она должна сообщать пользователю о невозможности деления на ноль, если он ввел его в качестве делителя.
while True:
    print('Введите два числа')
    number1 = float(input('1) '))
    number2 = float(input('2) '))
    while True:
        sign = input("Какую операцию выполнить '+', '-', '*', '/', '0' - выход из программы: ")
        if sign == '0' or sign == '+' or sign == '-' or sign == '*' or sign == '/':
            break 
        else: 
            print('Повторите ввод операции!')
    if sign == '0':
        break
    elif sign == '+':
        print('Сложение', number1 + number2)
    elif sign == '-':
        print('Вычитание', number1 - number2)
    elif sign == '*':
        print('Произведение', number1 * number2)
    else:
        if number2 != 0:
            ch = number1 / number2
            print(f'Частное {ch:.2f}')
        else:
            print('Попытка деления на нуль!')